Documents/бит_РегистрацияЛьготПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_РегистрацияЛьготПоЛС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_УдалитьЛьготыПоЛС</xr:Item>
				<xr:Item>InformationRegister.бит_ЛьготыПоЛС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПроживающих</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументНаЛьготу</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ДокументыПодтверждающиеЛьготу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КемВыдан</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛСвБДСоцзащиты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЛьгот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокументаЛьготы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияДокументаЛьготы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокДействияЛьготы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ЛьготыПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЛьготыПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокДействияЛьготы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаЛьготу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыПодтверждающиеЛьготу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛСвБДСоцзащиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Льготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЛьгот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_РегистрацияЛьготПоЛС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбеспечениеПроведенияДокумента

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "ЛицевойСчет";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	РеквизитыТабСписокУслуг = "Физлицо,Льгота"; // Через запятую.
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СписокПроживающих", Новый Структура(РеквизитыТабСписокУслуг), Отказ, Заголовок);
	
КонецПроцедуры // ПроверкаРеквизитов()

// Процедура проверяет добли строк.
//
Процедура ПроверитьДублиФизлиц(ТаблицаПоФизЛицам, Отказ, Заголовок)
	
	ТаблицаДублей = ТаблицаПоФизЛицам.Скопировать();
	
	// Подсчитываем количество повторений.
	ТаблицаДублей.Колонки.Добавить("КоличествоПовторений");
	ТаблицаДублей.ЗаполнитьЗначения(1, "КоличествоПовторений");
	ТаблицаДублей.Свернуть("ФизЛицо, Льгота", "КоличествоПовторений");
	
	// Если количество повторений > 1, выдаем сообщение об ошибке.
	Если ?(ТаблицаДублей.Количество() > 0, ТаблицаДублей.Итог("КоличествоПовторений") / ТаблицаДублей.Количество(), 0) > 1 Тогда
		
		ТекстСообщенияОбОшибке = "";
		
		// ТаблицаПоЦБ.Индексы.Добавить("Контрагент");.
		
		// Цикл по каждому найденному повторению.
		Для Каждого СтрокаТаблицыДублей Из ТаблицаДублей Цикл
			
			Если СтрокаТаблицыДублей.КоличествоПовторений = 1 Тогда
				Продолжить; // повторений нет.
			КонецЕсли;
			
			// Добавим перевод строки, если требуется.
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке 
			+ ?(НЕ ЗначениеЗаполнено(ТекстСообщенияОбОшибке), "", "
			|");
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ "В строках №№ "; 
			
			// Выводим номера строк.
			СписокНомеровСтрок = "";
			МассивСтрок = ТаблицаПоФизЛицам.НайтиСтроки(Новый Структура("ФизЛицо", СтрокаТаблицыДублей.ФизЛицо));
			
			
			Для Каждого Строка Из МассивСтрок Цикл
				СписокНомеровСтрок = СписокНомеровСтрок + ?(НЕ ЗначениеЗаполнено(СписокНомеровСтрок), "", ", ") + Строка.НомерСтроки;
			КонецЦикла;
			
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ СписокНомеровСтрок
			+ " табличной части ""Физ. лица"" указаны одни и те же.";
			
		КонецЦикла;
		
		бит_ОбщегоНазначения.ОшибкаПриПроведении(ТекстСообщенияОбОшибке, Отказ, Заголовок);
		
	КонецЕсли;
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоФизЛицам,Отказ, Заголовок)
	
	ДатаДока = Дата;
	НачислениеПоУсл = Движения.бит_ЛьготыПоЛС;
	Для каждого СтрокаТЧ Из ТаблицаПоФизЛицам Цикл
		
		Движение = НачислениеПоУсл.Добавить();
		Движение.Период                 = ДатаДока;
		Движение.ЛицевойСчет            = СтруктураШапкиДокумента.ЛицевойСчет;
		Движение.ФизЛицо                = СтрокаТЧ.ФизЛицо;
		Движение.СрокДействияЛьготы     = СтрокаТЧ.СрокДействияЛьготы;
		Движение.Льготы                 = СтрокаТЧ.Льгота;
		Движение.НомерДокумента         = СтрокаТЧ.НомерДокументаЛьготы;
		Движение.КемВыдан               = СтрокаТЧ.КемВыдан;
		Движение.ДатаВыдачи             = СтрокаТЧ.ДатаВыдачи;
		Движение.ДокументНаЛьготу       = СтрокаТЧ.ДокументНаЛьготу;    
		Движение.ЛСвБДСоцзащиты         = СтрокаТЧ.ЛСвБДСоцзащиты;
		// БИТ_ЖКХ изменение кода. Начало. 04.10.2011{{
		Движение.СерияДокумента         = СтрокаТЧ.СерияДокументаЛьготы;
		// БИТ_ЖКХ изменение кода. Конец. 04.10.2011}}
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Обработчик события "ОбработкаПроведения" документа.
//
Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ФизЛицо"                 ,"ФизЛицо");
	СтруктураПолей.Вставить("Льгота"                  ,"Льгота");
	СтруктураПолей.Вставить("СрокДействияЛьготы"      ,"СрокДействияЛьготы");
	СтруктураПолей.Вставить("НомерДокументаЛьготы"    ,"НомерДокументаЛьготы");
	СтруктураПолей.Вставить("ДокументНаЛьготу"        ,"ДокументНаЛьготу");
	СтруктураПолей.Вставить("КемВыдан"                ,"КемВыдан");
	СтруктураПолей.Вставить("ДатаВыдачи"              ,"ДатаВыдачи");
	СтруктураПолей.Вставить("ЛСвБДСоцзащиты"          ,"ЛСвБДСоцзащиты");
	// БИТ_ЖКХ изменение кода. Начало. 04.10.2011{{
	СтруктураПолей.Вставить("СерияДокументаЛьготы"    ,"СерияДокументаЛьготы");
	// БИТ_ЖКХ изменение кода. Конец. 04.10.2011}}
	
	РезультатЗапросаПоФизЛицам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "СписокПроживающих", СтруктураПолей);
	ТаблицаПоФизЛицам          = РезультатЗапросаПоФизЛицам.Выгрузить();
	
	ПроверкаРеквизитовТЧ(ТаблицаПоФизЛицам, СтруктураШапкиДокумента,Отказ, Заголовок);
	
	ПроверитьДублиФизлиц(ТаблицаПоФизЛицам, Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоФизЛицам, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

// Обработчик события "ОбработкаЗаполнения" документа.
//
Процедура ОбработкаЗаполнения(Основание)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события "ПередЗаписью". 
//  
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СписокЛицевыхСчетов = ""+ЛицевойСчет.Наименование;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
